#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.assume_role: Reading...
aws_iam_role.iam_role_eks_node_group: Refreshing state... [id=earth-dev-eks-node-group-role]
aws_eip.eip_02: Refreshing state... [id=eipalloc-033471c6633642eb4]
aws_eip.eip_01: Refreshing state... [id=eipalloc-043afc801cf38bf86]
aws_vpc.vpc: Refreshing state... [id=vpc-0dd88d6bb6746f582]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3552664922]
aws_iam_role.iam_role_eks: Refreshing state... [id=earth-dev-eks-cluster-role]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=earth-dev-eks-cluster-role-20231123073810556500000002]
aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=earth-dev-eks-cluster-role-20231123073810536100000001]
aws_iam_role_policy.iam_role_policy_s3: Refreshing state... [id=earth-dev-eks-node-group-role:s3_policy]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=earth-dev-eks-node-group-role-20231123073811084000000005]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=earth-dev-eks-node-group-role-20231123073810984500000003]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=earth-dev-eks-node-group-role-20231123073811003400000004]
aws_security_group.cluster_sg: Refreshing state... [id=sg-034671e0f68ca45ee]
aws_subnet.public_subnet_01: Refreshing state... [id=subnet-0df707aa568b2043b]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0a0c5b2de73de191b]
aws_subnet.public_subnet_02: Refreshing state... [id=subnet-001e3c1518932311b]
aws_subnet.private_subnet_02: Refreshing state... [id=subnet-0164bf7d1de9b64f2]
aws_security_group.allnodes-sg: Refreshing state... [id=sg-084b142b3cf6d10ad]
aws_subnet.private_subnet_01: Refreshing state... [id=subnet-015f6aa032f44efdf]
aws_nat_gateway.nat_gateway_01: Refreshing state... [id=nat-0bcf1b69e66d3e4cb]
aws_route_table.public_route_table: Refreshing state... [id=rtb-094424fab96be1f4f]
aws_nat_gateway.nat_gateway_02: Refreshing state... [id=nat-083b34e77ec7a644f]
aws_eks_cluster.eks_cluster: Refreshing state... [id=earth-dev]
aws_route_table.private_route_table_01: Refreshing state... [id=rtb-01799b193a81c90f6]
aws_route_table_association.route_table_association_p01: Refreshing state... [id=rtbassoc-0ea4b808ae96c1f20]
aws_route_table_association.route_table_association_p02: Refreshing state... [id=rtbassoc-0e933324d2ca6b48c]
aws_route_table.private_route_table_02: Refreshing state... [id=rtb-0923c8e81f747ba56]
aws_route_table_association.route_table_association_i01: Refreshing state... [id=rtbassoc-032c41b084c10ea66]
aws_route_table_association.route_table_association_i02: Refreshing state... [id=rtbassoc-0e35c2a37938ead3b]
aws_eks_identity_provider_config.oidc: Refreshing state... [id=earth-dev:earth-dev]
aws_launch_template.app_node: Refreshing state... [id=lt-0a2ee169d7d2ae42b]
aws_eks_node_group.app_node_group: Refreshing state... [id=earth-dev:app-node-group]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_node_group.app_node_group will be created
  + resource "aws_eks_node_group" "app_node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "earth-dev"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "app-node-group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::318374019075:role/earth-dev-eks-node-group-role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-015f6aa032f44efdf",
          + "subnet-0164bf7d1de9b64f2",
        ]
      + tags_all               = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
      + version                = (known after apply)

      + launch_template {
          + id      = "lt-0a2ee169d7d2ae42b"
          + name    = (known after apply)
          + version = "3"
        }

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jonghak-dev, Action: `pull_request`, Workflow: `Terraform apply`*